In [1]:
%load_ext sql

In [2]:
%sql sqlite:///chinook.db

# Longest song in each genre

In [9]:
%%sql
SELECT t.genreid, t.trackid, t.milliseconds
FROM tracks AS t 
WHERE milliseconds = (
    SELECT MAX(milliseconds)
    FROM tracks AS g 
    WHERE t.genreid = g.genreid 
)
ORDER BY t.milliseconds
LIMIT 5

 * sqlite:///chinook.db
Done.

[(5, 118, 163265),
 (25, 3451, 174813),
 (12, 1054, 292075),
 (16, 3354, 300605),
 (8, 2228, 366733)]

In [10]:
%%sql
SELECT genreid, trackid, MAX(milliseconds)
FROM tracks
GROUP BY genreid 
ORDER BY milliseconds 
LIMIT 5

 * sqlite:///chinook.db
Done.

[(5, 118, 163265),
 (25, 3451, 174813),
 (12, 1054, 292075),
 (16, 3354, 300605),
 (8, 2228, 366733)]

# Track with composer missing

In [35]:
%%sql
SELECT t.trackid 
FROM tracks AS t 
WHERE NOT EXISTS(
    SELECT *
    FROM tracks AS c 
    WHERE t.composer = c.composer 
)
ORDER BY milliseconds ASC
LIMIT 5

 * sqlite:///chinook.db
Done.

[(168,), (170,), (178,), (172,), (2241,)]

In [12]:
%%sql
SELECT trackid
FROM tracks 
WHERE composer IS NULL
ORDER BY milliseconds ASC 
LIMIT 5

 * sqlite:///chinook.db
Done.

[(168,), (170,), (178,), (172,), (2241,)]

# Write employee and their boss

In [90]:
%%sql
SELECT e.firstname AS employee
, (
    SELECT b.firstname
    FROM employees AS b 
    WHERE e.reportsto = b.employeeid 
) AS boss
FROM employees AS e;

 * sqlite:///chinook.db
Done.

[('Andrew', None),
 ('Nancy', 'Andrew'),
 ('Jane', 'Nancy'),
 ('Margaret', 'Nancy'),
 ('Steve', 'Nancy'),
 ('Michael', 'Andrew'),
 ('Robert', 'Michael'),
 ('Laura', 'Michael')]

In [94]:
%%sql
SELECT e.firstname AS employee
, b.firstname AS boss
FROM employees AS e 
LEFT JOIN employees AS b
    ON e.reportsto = b.employeeid

 * sqlite:///chinook.db
Done.

[('Andrew', None),
 ('Nancy', 'Andrew'),
 ('Jane', 'Nancy'),
 ('Margaret', 'Nancy'),
 ('Steve', 'Nancy'),
 ('Michael', 'Andrew'),
 ('Robert', 'Michael'),
 ('Laura', 'Michael')]